//ตัวแปร คือ ชื่อตั้งเองอะไรก็ได้ มีหน้าที่ในการเก็บข้อมูลที่เกิดขึ้นในโปรแกรม
//การใช้งานตัวแปร คือ การเอาค่าไปเก็บในตัวแปร หรือ การเอาค่าที่เก็บในตัวแปรมาใช้งาน
 
//Array คือ แถวลำดับ เป็นโครงสร้างข้อมูล
//แถวลำดับ ในที่นี้เปรียบเสมือนมีช่องหลายๆ ช่องเรียงชิดติดกัน และมี index number กำกับโดยเริ่มที่ 0
 
//เราจะใช้อาเรย์กับการเขียนโปรแกรมในเรื่องของตัวแปร ก็จะเกิดสิ่งที่เรียกว่า ตัวแปรอาร์เรย์
#include  "stdio.h" //หรือ <stdio.h>
 
void  main(){
  //ตัวแปรปกติ (1 ตัว มี 1 ช่อง เก็บได้ 1 ข้อมูล แต่ข้อมูลในช่องสามารถเปลี่ยนไปได้เรื่อยๆ)
  int  dataA;
  double  dataB = 30;
 
  //ตัวแปรอาร์เรย์ (1 ตัว มีช่องหลายช่อง เก็บได้หลายข้อมูล ข้อมูลในแต่ละช่องปลี่ยนไปได้เรื่อยๆ)
  int  dataC[5];
  double  dataD[] = {10, 20, 30, 40, 50};
 
  dataA = 111;
  dataB = 222;
 
  printf("Data A is %d\n", dataA);
  printf("Data B is %lf\n", dataB);
  printf("-------------------------\n");
 
  dataC[2] = 100;
  dataC[0] = 500;
  printf("Data C [2] is %d\n", dataC[2]);  //แสดง 100
  printf("Data D [5] is %lf\n", dataD[4]);   //แสดง  50
}